In [26]:
import numpy as np

import pandas as pd

import pymysql as mysql
import matplotlib.pyplot as plt
import pandas as pd
from sqlalchemy import create_engine

conn=mysql.connect(host='localhost',port=int(3306),user= 'root',passwd='password',db='retail_database')

In [3]:
# Load the CSV files into DataFrames
df_customer_info = pd.read_csv('/Users/smsultanmahmudrahat/Downloads/department/ADS_last_Project/project/data/customer_info.csv')
df_transactions_details = pd.read_csv('/Users/smsultanmahmudrahat/Downloads/department/ADS_last_Project/project/data/transaction_details.csv')
df_transaction_logistics = pd.read_csv('/Users/smsultanmahmudrahat/Downloads/department/ADS_last_Project/project/data/transaction_logistics.csv')
df_product_info = pd.read_csv('/Users/smsultanmahmudrahat/Downloads/department/ADS_last_Project/project/data/product_info.csv')
df_feedback = pd.read_csv('/Users/smsultanmahmudrahat/Downloads/department/ADS_last_Project/project/data/feedback.csv')

In [28]:
import pandas as pd
from sqlalchemy import create_engine

# Database connection details
db_username = 'root'
db_password = 'password'
db_host = 'localhost'  # e.g., 'localhost'
db_database = 'retail_database'  # Database name


# Create a connection to the database
engine = create_engine(f'mysql+pymysql://{db_username}:{db_password}@{db_host}/{db_database}')

# Insert data into the tables
df_customer_info.to_sql('customer_info', con=engine, if_exists='append', index=False)
print("Data inserted successfully.")

Data inserted successfully.

In [33]:
# Function to parse dates with multiple formats
def parse_dates(date_str):
    for fmt in ('%m/%d/%Y', '%m/%d/%y'):
        try:
            return pd.to_datetime(date_str, format=fmt)
        except ValueError:
            pass
    raise ValueError(f"no valid date format found for {date_str}")
df_transactions_details['Date'] = df_transactions_details['Date'].apply(parse_dates).dt.strftime('%Y-%m-%d')

In [36]:
df_transactions_details.to_sql('transactions_details', con=engine, if_exists='append', index=False)

300749

In [37]:
df_transaction_logistics.to_sql('transaction_logistics', con=engine, if_exists='replace', index=False)

300749

In [39]:
df_product_info.to_sql('product_info', con=engine, if_exists='append', index=False)

300749

In [40]:
df_feedback.to_sql('feedback', con=engine, if_exists='replace', index=False)

300749

In [44]:
from sqlalchemy import create_engine, text
# Function to execute SQL queries and print results
def execute_query(engine, query):
    with engine.connect() as conn:
        result = conn.execute(text(query))
        for row in result:
            print(row)

# List of verification queries
queries = [
    "SHOW TABLES IN retail_database;",
    "SELECT * FROM customer_info LIMIT 10;",
    "SELECT * FROM transactions_details LIMIT 10;",
    "SELECT * FROM transaction_logistics LIMIT 10;",
    "SELECT * FROM product_info LIMIT 10;",
    "SELECT * FROM feedback LIMIT 10;",
    """
    SELECT td.*, ci.Name, ci.Email
    FROM transactions_details td
    JOIN customer_info ci ON td.Customer_ID = ci.Customer_ID
    LIMIT 10;
    """,
    """
    SELECT tl.*, td.Date, td.Amount
    FROM transaction_logistics tl
    JOIN transactions_details td ON tl.Transaction_ID = td.Transaction_ID
    LIMIT 10;
    """,
    """
    SELECT fb.*, pi.Product_Category, pi.Product_Brand
    FROM feedback fb
    JOIN product_info pi ON fb.Product_ID = pi.Product_ID
    LIMIT 10;
    """,
    """
    SELECT fb.*, ci.Name, ci.Email
    FROM feedback fb
    JOIN customer_info ci ON fb.Customer_ID = ci.Customer_ID
    LIMIT 10;
    """
]

# Execute and print results for each query
for query in queries:
    try:
        print(f"Executing query: {query}")
        execute_query(engine, query)
        print("\n")
    except Exception as e:
        print(f"Error executing query: {query}")
        print(e)
        print("\n")

Executing query: SHOW TABLES IN retail_database;
('customer_info',)
('feedback',)
('product_info',)
('transaction_logistics',)
('transactions_details',)


Executing query: SELECT * FROM customer_info LIMIT 10;
(1, 37249, 'Michelle Harrington', 'Ebony39@gmail.com', '1414786801', '3959 Amanda Burgs', 'Dortmund', 'Berlin', '77985', 'Germany', 21, 'Male', 'Low', 'Regular')
(2, 69749, 'Kelsey Hill', 'Mark36@gmail.com', '6852899987', '82072 Dawn Centers', 'Nottingham', 'England', '99071', 'UK', 19, 'Female', 'Low', 'Premium')
(3, 30192, 'Scott Jensen', 'Shane85@gmail.com', '8362160449', '4133 Young Canyon', 'Geelong', 'New South Wales', '75929', 'Australia', 48, 'Male', 'Low', 'Regular')
(4, 62101, 'Joseph Miller', 'Mary34@gmail.com', '2776751724', '8148 Thomas Creek Suite 100', 'Edmonton', 'Ontario', '88420', 'Canada', 56, 'Male', 'High', 'Premium')
(5, 27901, 'Debra Coleman', 'Charles30@gmail.com', '9098267635', '5813 Lori Ports Suite 269', 'Bristol', 'England', '48704', 'UK', 22, 'Male', 'Low', 'Premium')
(6, 41289, 'Ryan Johnson', 'Haley12@gmail.com', '3292677006', '532 Ashley Crest Suite 014', 'Brisbane', 'New South Wales', '74430', 'Australia', 58, 'Female', 'Medium', 'Premium')
(7, 97285, 'Erin Lewis', 'Arthur76@gmail.com', '1578355423', '600 Brian Prairie Suite 497', 'Kitchener', 'Ontario', '47545', 'Canada', 29, 'Female', 'Low', 'New')
(8, 26603, 'Angela Fields', 'Tanya94@gmail.com', '3668096144', '237 Young Curve', 'Munich', 'Berlin', '86862', 'Germany', 29, 'Male', 'Medium', 'Premium')
(9, 80175, 'Diane Clark', 'Martin39@gmail.com', '6219779557', '8823 Mariah Heights Apt. 263', 'Wollongong', 'New South Wales', '39820', 'Australia', 46, 'Male', 'Medium', 'New')
(10, 31878, 'Lori Bell', 'Jessica33@gmail.com', '6004895059', '6225 William Lodge', 'Cologne', 'Berlin', '64317', 'Germany', 25, 'Male', 'Medium', 'New')


Executing query: SELECT * FROM transactions_details LIMIT 10;
(1, 8691788, 37249, datetime.date(2023, 9, 18), 2023, 'September', datetime.timedelta(seconds=79435), 3, Decimal('108.03'), Decimal('324.09'))
(2, 2174773, 69749, datetime.date(2023, 12, 31), 2023, 'December', datetime.timedelta(seconds=31324), 2, Decimal('403.35'), Decimal('806.71'))
(3, 6679610, 30192, datetime.date(2023, 4, 26), 2023, 'April', datetime.timedelta(seconds=14789), 3, Decimal('354.48'), Decimal('1063.43'))
(4, 7232460, 62101, datetime.date(2023, 5, 8), 2023, 'May', datetime.timedelta(seconds=53717), 7, Decimal('352.41'), Decimal('2466.85'))
(5, 4983775, 27901, datetime.date(2024, 1, 10), 2024, 'January', datetime.timedelta(seconds=60847), 2, Decimal('124.28'), Decimal('248.55'))
(6, 6095326, 41289, datetime.date(2023, 9, 21), 2023, 'September', datetime.timedelta(seconds=84267), 4, Decimal('296.29'), Decimal('1185.17'))
(7, 5434096, 97285, datetime.date(2023, 6, 26), 2023, 'June', datetime.timedelta(seconds=48951), 2, Decimal('315.06'), Decimal('630.12'))
(8, 2344675, 26603, datetime.date(2023, 3, 24), 2023, 'March', datetime.timedelta(seconds=36776), 1, Decimal('46.59'), Decimal('46.59'))
(9, 4155845, 80175, datetime.date(2024, 1, 6), 2024, 'January', datetime.timedelta(seconds=52706), 8, Decimal('328.84'), Decimal('2630.71'))
(10, 4926148, 31878, datetime.date(2023, 10, 4), 2023, 'October', datetime.timedelta(seconds=80860), 10, Decimal('397.61'), Decimal('3976.11'))


Executing query: SELECT * FROM transaction_logistics LIMIT 10;
(8691788.0, 'Same-Day', 'Debit Card', 'Shipped')
(2174773.0, 'Standard', 'Credit Card', 'Processing')
(6679610.0, 'Same-Day', 'Credit Card', 'Processing')
(7232460.0, 'Standard', 'PayPal', 'Processing')
(4983775.0, 'Standard', 'Cash', 'Shipped')
(6095326.0, 'Express', 'PayPal', 'Pending')
(5434096.0, 'Standard', 'Cash', 'Processing')
(2344675.0, 'Same-Day', 'Cash', 'Processing')
(4155845.0, 'Same-Day', 'Cash', 'Delivered')
(4926148.0, 'Standard', 'Cash', 'Delivered')


Executing query: SELECT * FROM product_info LIMIT 10;
(1, 'P000', 'Clothing', 'Nike', 'Shorts', 'Cycling shorts')
(2, 'P001', 'Electronics', 'Samsung', 'Tablet', 'Lenovo Tab')
(3, 'P002', 'Books', 'Penguin Books', "Children's", 'Sports equipment')
(4, 'P003', 'Home Decor', 'Home Depot', 'Tools', 'Utility knife')
(5, 'P004', 'Grocery', 'Nestle', 'Chocolate', 'Chocolate cookies')
(6, 'P001', 'Electronics', 'Apple', 'Tablet', 'Lenovo Tab')
(7, 'P005', 'Electronics', 'Samsung', 'Television', 'QLED TV')
(8, 'P006', 'Clothing', 'Zara', 'Shirt', 'Dress shirt')
(9, 'P007', 'Grocery', 'Nestle', 'Chocolate', 'Dark chocolate')
(10, 'P008', 'Home Decor', 'Home Depot', 'Decorations', 'Candles')


Executing query: SELECT * FROM feedback LIMIT 10;
('P000', 'Excellent', 5.0)
('P001', 'Excellent', 4.0)
('P002', 'Average', 2.0)
('P003', 'Excellent', 4.0)
('P004', 'Bad', 1.0)
('P001', 'Good', 4.0)
('P005', 'Bad', 1.0)
('P006', 'Bad', 1.0)
('P007', 'Bad', 1.0)
('P008', 'Excellent', 4.0)


Executing query:
    SELECT td.*, ci.Name, ci.Email
    FROM transactions_details td
    JOIN customer_info ci ON td.Customer_ID = ci.Customer_ID
    LIMIT 10;

(1, 8691788, 37249, datetime.date(2023, 9, 18), 2023, 'September', datetime.timedelta(seconds=79435), 3, Decimal('108.03'), Decimal('324.09'), 'Michelle Harrington', 'Ebony39@gmail.com')
(9627, 2322638, 37249, datetime.date(2023, 6, 14), 2023, 'June', datetime.timedelta(seconds=75795), 7, Decimal('75.87'), Decimal('531.12'), 'Michelle Harrington', 'Ebony39@gmail.com')
(61482, 1814136, 37249, datetime.date(2024, 2, 6), 2024, 'February', datetime.timedelta(seconds=79011), 6, Decimal('379.38'), Decimal('2276.30'), 'Michelle Harrington', 'Ebony39@gmail.com')
(99719, 4895457, 37249, datetime.date(2023, 12, 8), 2023, 'December', datetime.timedelta(seconds=50804), 4, Decimal('148.64'), Decimal('594.55'), 'Michelle Harrington', 'Ebony39@gmail.com')
(204468, 5836653, 37249, datetime.date(2024, 1, 2), 2024, 'January', datetime.timedelta(seconds=45045), 8, Decimal('344.92'), Decimal('2759.33'), 'Michelle Harrington', 'Ebony39@gmail.com')
(300750, 8691788, 37249, datetime.date(2023, 9, 18), 2023, 'September', datetime.timedelta(seconds=79435), 3, Decimal('108.03'), Decimal('324.09'), 'Michelle Harrington', 'Ebony39@gmail.com')
(310376, 2322638, 37249, datetime.date(2023, 6, 14), 2023, 'June', datetime.timedelta(seconds=75795), 7, Decimal('75.87'), Decimal('531.12'), 'Michelle Harrington', 'Ebony39@gmail.com')
(362231, 1814136, 37249, datetime.date(2024, 2, 6), 2024, 'February', datetime.timedelta(seconds=79011), 6, Decimal('379.38'), Decimal('2276.30'), 'Michelle Harrington', 'Ebony39@gmail.com')
(400468, 4895457, 37249, datetime.date(2023, 12, 8), 2023, 'December', datetime.timedelta(seconds=50804), 4, Decimal('148.64'), Decimal('594.55'), 'Michelle Harrington', 'Ebony39@gmail.com')
(505217, 5836653, 37249, datetime.date(2024, 1, 2), 2024, 'January', datetime.timedelta(seconds=45045), 8, Decimal('344.92'), Decimal('2759.33'), 'Michelle Harrington', 'Ebony39@gmail.com')


Executing query:
    SELECT tl.*, td.Date, td.Amount
    FROM transaction_logistics tl
    JOIN transactions_details td ON tl.Transaction_ID = td.Transaction_ID
    LIMIT 10;

(8691788.0, 'Same-Day', 'Debit Card', 'Shipped', datetime.date(2023, 9, 18), Decimal('108.03'))
(8691788.0, 'Same-Day', 'Debit Card', 'Shipped', datetime.date(2023, 12, 29), Decimal('147.38'))
(8691788.0, 'Same-Day', 'Debit Card', 'Shipped', datetime.date(2023, 9, 18), Decimal('108.03'))
(8691788.0, 'Same-Day', 'Debit Card', 'Shipped', datetime.date(2023, 12, 29), Decimal('147.38'))
(2174773.0, 'Standard', 'Credit Card', 'Processing', datetime.date(2023, 12, 31), Decimal('403.35'))
(2174773.0, 'Standard', 'Credit Card', 'Processing', datetime.date(2023, 12, 31), Decimal('403.35'))
(6679610.0, 'Same-Day', 'Credit Card', 'Processing', datetime.date(2023, 4, 26), Decimal('354.48'))
(6679610.0, 'Same-Day', 'Credit Card', 'Processing', datetime.date(2023, 4, 26), Decimal('354.48'))
(7232460.0, 'Standard', 'PayPal', 'Processing', datetime.date(2023, 5, 8), Decimal('352.41'))
(7232460.0, 'Standard', 'PayPal', 'Processing', datetime.date(2023, 5, 8), Decimal('352.41'))


Executing query:
    SELECT fb.*, pi.Product_Category, pi.Product_Brand
    FROM feedback fb
    JOIN product_info pi ON fb.Product_ID = pi.Product_ID
    LIMIT 10;

('P000', 'Excellent', 5.0, 'Clothing', 'Nike')
('P000', 'Excellent', 5.0, 'Clothing', 'Nike')
('P000', 'Excellent', 5.0, 'Clothing', 'Nike')
('P000', 'Excellent', 5.0, 'Clothing', 'Nike')
('P000', 'Excellent', 5.0, 'Clothing', 'Nike')
('P000', 'Excellent', 5.0, 'Clothing', 'Nike')
('P000', 'Excellent', 5.0, 'Clothing', 'Nike')
('P000', 'Excellent', 5.0, 'Clothing', 'Nike')
('P000', 'Excellent', 5.0, 'Clothing', 'Nike')
('P000', 'Excellent', 5.0, 'Clothing', 'Nike')


Executing query:
    SELECT fb.*, ci.Name, ci.Email
    FROM feedback fb
    JOIN customer_info ci ON fb.Customer_ID = ci.Customer_ID
    LIMIT 10;

Error executing query:
    SELECT fb.*, ci.Name, ci.Email
    FROM feedback fb
    JOIN customer_info ci ON fb.Customer_ID = ci.Customer_ID
    LIMIT 10;

(pymysql.err.OperationalError) (1054, "Unknown column 'fb.Customer_ID' in 'on clause'")
[SQL:
    SELECT fb.*, ci.Name, ci.Email
    FROM feedback fb
    JOIN customer_info ci ON fb.Customer_ID = ci.Customer_ID
    LIMIT 10;
    ]
(Background on this error at: https://sqlalche.me/e/20/e3q8)